<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Base Star Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during Star for
    | various messages that we need to display to the user.
    |
    */

    "exceptions" => [
        "invalid_star_actor" => "امکان ثبت امتیاز وجود ندارد، چون مشخص نیست چه کسی آن را داده است.",
        "max_rate" => "امتیاز باید کمتر یا مساوی :max_rate باشد، در حالی که :rate داده شده است",
        "min_rate" => "امتیاز باید بیشتر یا مساوی :min_rate باشد، در حالی که :rate داده شده است",
    ],

    "entity_names" => [
        "star" => "ستاره",
    ],

    'events' => [
        'star_added' => [
            'title' => 'افزودن ستاره',
            'description' => 'هنگامی که یک امتیاز ستاره اضافه می‌شود، این رویداد فعال می‌شود.',
        ],

        'star_removed' => [
            'title' => 'حذف ستاره',
            'description' => 'هنگامی که یک امتیاز ستاره حذف می‌شود، این رویداد فعال می‌شود.',
        ],

        'star_removing' => [
            'title' => 'در حال حذف ستاره',
            'description' => 'هنگامی که یک امتیاز ستاره در حال حذف است، این رویداد فعال می‌شود.',
        ],

        'star_updated' => [
            'title' => 'به‌روزرسانی ستاره',
            'description' => 'هنگامی که یک امتیاز ستاره به‌روزرسانی می‌شود، این رویداد فعال می‌شود.',
        ],

        'star_updating' => [
            'title' => 'در حال به‌روزرسانی ستاره',
            'description' => 'هنگامی که یک امتیاز ستاره در حال به‌روزرسانی است، این رویداد فعال می‌شود.',
        ],
    ],

];
